The tsv data used was taken from https://datatables.net/extensions/buttons/examples/html5/tsv.html

In [1]:
import pandas as pd

### TSV file

In [2]:
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values.tsv')
employee.head()

,Name,Position,Office,Age,Start date,Salary
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [8]:
cols = ['Name', 'Position']
employee[cols].head()

             Name                       Position
0      Airi Satou                     Accountant
1  Angelica Ramos  Chief Executive Officer (CEO)
2      Ashton Cox        Junior Technical Author
3   Bradley Greer              Software Engineer
4  Brenden Wagner              Software Engineer

In [9]:
employee.dtypes

Name          object
Position      object
Office        object
Age            int64
Start date    object
Salary        object
dtype: object

In [10]:
#display int data types
import numpy as np
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values.tsv')
employee.select_dtypes(include = [np.number]).dtypes

Age    int64
dtype: object

#### Numpy

A fundamental package for scientific computing with Python. Some of it's main functionalities:
- a powerful N-dimensional array object
- sophisticated (broadcasting) functions
- tools for integrating C/C++ and Fortran code
- useful linear algebra, Fourier transform and random number capabilities

For more information: https://numpy.org

In [13]:
#some in built methods for data analysis
employee.describe()

             Age
count  57.000000
mean   42.736842
std    14.877507
min    19.000000
25%    30.000000
50%    42.000000
75%    56.000000
max    66.000000

In [15]:
#number of rows and columns
employee.shape

(57, 6)

In [16]:
#type of object
type(employee)

pandas.core.frame.DataFrame

In [24]:
employee = pd.read_table('/Users/ryanheadley/Documents/GitHub/Development/Udemy/Learn Data Analysis using Pandas and Python (2|3)/ressources/DataTables example - Tab separated values.tsv')
cols = ['Name', 'Position','Ofc','Age','StartDate','Sal']
employee.columns = cols
employee.head()

,Name,Position,Ofc,Age,StartDate,Sal
0,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
1,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
3,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
4,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

### Pipe delimited file

In [11]:
reads = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt')
reads.head()

                 ReportDt|Unit|Power
0  12/31/2009|Arkansas Nuclear 1|100
1  12/31/2009|Arkansas Nuclear 2|100
2     12/31/2009|Beaver Valley 1|100
3     12/31/2009|Beaver Valley 2|100
4         12/31/2009|Braidwood 1|100

In [12]:
reads_nice = pd.read_table('https://www.nrc.gov/reading-rm/doc-collections/event-status/reactor-status/2009/2009PowerStatus.txt', sep="|", nrows=5)
reads_nice.head()

     ReportDt                Unit  Power
0  12/31/2009  Arkansas Nuclear 1    100
1  12/31/2009  Arkansas Nuclear 2    100
2  12/31/2009     Beaver Valley 1    100
3  12/31/2009     Beaver Valley 2    100
4  12/31/2009         Braidwood 1    100